## Pandas

In [1]:
## importing pands

In [2]:
import pandas as pd

In [3]:
## print the version of pandas that has been imported

In [6]:
pd.__version__

'1.4.2'

In [7]:
import warnings 
warnings.filterwarnings('ignore')

In [8]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : 4bfe3d07b4858144c219b9346329027024102ab6
python           : 3.9.12.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22631
machine          : AMD64
processor        : Intel64 Family 6 Model 126 Stepping 5, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_India.1252

pandas           : 1.4.2
numpy            : 1.21.5
pytz             : 2021.3
dateutil         : 2.8.2
pip              : 21.2.4
setuptools       : 61.2.0
Cython           : 0.29.28
pytest           : 7.1.1
hypothesis       : None
sphinx           : 4.4.0
blosc            : None
feather          : None
xlsxwriter       : 3.0.3
lxml.etree       : 4.8.0
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 2.11.3
IPython          : 8.2.0
pandas_datareader: None
bs4              : 4.11.1
bottleneck       : 1.3.4
brotli           :
fastparquet      : None
fsspec           : 2022.02.0
gcsfs            : None
markupsafe       : 2.0.1
matplotlib       : 3.5.1
numba            : 0.55.1
numexpr          : 2.8.1
odfpy            : None
openpyxl         : 3.0.9
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.7.3
snappy           :
sqlalchemy       : 1.4.32
tables           : 3.6.1
tabulate         : 0.8.9
xarray           : 0.20.1
xlrd             : 2.0.1
xlwt             : None
zstandard        : None

In [119]:
import numpy as np
data={'animal':['cat','cat','snake','dog','dog','cat','snake','cat','dog','dog'],
     'age':[2.5,3,0.5,np.nan,5,2,4.5,np.nan,7,3],
     'visits':[1,3,2,3,2,3,1,1,2,1],
     'priority':['yes','yes','no','yes','no','no','no','yes','no','no']}

In [120]:
data

{'animal': ['cat',
  'cat',
  'snake',
  'dog',
  'dog',
  'cat',
  'snake',
  'cat',
  'dog',
  'dog'],
 'age': [2.5, 3, 0.5, nan, 5, 2, 4.5, nan, 7, 3],
 'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

In [121]:
df=pd.DataFrame(data)
df.head()
#head gives first 5 rows

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no

In [84]:
labels=['a','b','c','d','e','f','g','h','i','j']
df=pd.DataFrame(data, index = labels)
df.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

In [85]:
df.tail()

  animal  age  visits priority
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [86]:
df.tail(7)

  animal  age  visits priority
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [87]:
df.head(7)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no

In [88]:
#to save data
df.to_csv("Data.csv")

In [89]:
df1=pd.read_csv("Data.csv")
df.head

<bound method NDFrame.head of   animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no>

In [90]:
df2=pd.read_csv("C:/Users/Dell/Desktop/python.csv")
df2.head()

  Unnamed: 0  sid    sname  m1  m2
0          a   10  neelema  10  45
1          b   12      POD  29  17
2          c   13   Kaleem  23  33
3          d   14     sonu  56  35
4          e   15      afu  78  79

In [91]:
df2.iloc[:,2]#indexlocation #slicing

0     neelema
1         POD
2      Kaleem
3        sonu
4         afu
5         uma
6       yumna
7    shridevi
8     srushti
9    shravani
Name: sname, dtype: object

In [92]:
df2.iloc[1,:]

Unnamed: 0      b
sid            12
sname         POD
m1             29
m2             17
Name: 1, dtype: object

In [93]:
df2.iloc[0:4:2]

  Unnamed: 0  sid    sname  m1  m2
0          a   10  neelema  10  45
2          c   13   Kaleem  23  33

In [94]:
df2.iloc[:,-2]

0    10
1    29
2    23
3    56
4    78
5    23
6    45
7    89
8    60
9    59
Name: m1, dtype: int64

In [95]:
df2.iloc[:,-1]

0    45
1    17
2    33
3    35
4    79
5    78
6    90
7    99
8    91
9    32
Name: m2, dtype: int64

In [96]:
df2.iloc[1,1:3]

sid       12
sname    POD
Name: 1, dtype: object

In [97]:
df2.iloc[2:3,0:2]

  Unnamed: 0  sid
2          c   13

In [98]:
df2.iloc[1:4,2:4]

    sname  m1
1     POD  29
2  Kaleem  23
3    sonu  56

In [99]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  10 non-null     object
 1   sid         10 non-null     int64
 2   sname       10 non-null     object
 3   m1          10 non-null     int64
 4   m2          10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 528.0+ bytes

In [100]:
df2.describe()

             sid         m1         m2
count  10.000000  10.000000  10.000000
mean   15.400000  47.200000  59.900000
std     3.204164  25.750081  30.329487
min    10.000000  10.000000  17.000000
25%    13.250000  24.500000  33.500000
50%    15.500000  50.500000  61.500000
75%    17.750000  59.750000  87.250000
max    20.000000  89.000000  99.000000

In [101]:
df.loc[df.index[[3,4,8]],['animal','age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [102]:
df[df['visits']>=3]#Eselcting rows where the number of visitid is grather than 3

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

In [103]:
#selecting rows with nulls
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [104]:
df[(df['animal']=='cat')&(df['age']<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [105]:
df[df['age'].between(2,4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [106]:
df.loc['b','age']=1.5
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  1.5       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [107]:
df['visits'].sum()

19

In [108]:
df.groupby('animal')['age'].mean()

animal
cat      2.0
dog      5.0
snake    2.5
Name: age, dtype: float64

In [109]:
df['animal'].value_counts()

cat      4
dog      4
snake    2
Name: animal, dtype: int64

In [110]:
df['priority'].value_counts()

no     6
yes    4
Name: priority, dtype: int64

In [111]:
df.sort_values(by=['visits'],ascending=[True])

  animal  age  visits priority
a    cat  2.5       1      yes
g  snake  4.5       1       no
h    cat  NaN       1      yes
j    dog  3.0       1       no
c  snake  0.5       2       no
e    dog  5.0       2       no
i    dog  7.0       2       no
b    cat  1.5       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

In [112]:
#df['priority']=df['priority'].map({'yes' : True,'no' : False})

In [113]:
import random

In [114]:
df=pd.DataFrame(np.random.random(size=(5,3)))
print(df)

          0         1         2
0  0.457628  0.185545  0.311401
1  0.263399  0.967543  0.485198
2  0.243737  0.043755  0.702260
3  0.407595  0.351867  0.206220
4  0.089973  0.458284  0.780052

In [115]:
df.sub(df.mean(axis=1),axis=0)

          0         1         2
0  0.139437 -0.132646 -0.006790
1 -0.308648  0.395496 -0.086849
2 -0.086180 -0.286162  0.372342
3  0.085701  0.029973 -0.115674
4 -0.352797  0.015515  0.337283

In [122]:
filtered_df=df.query('age >=1') #had to go back and run the 1st few codes for df-animal
print(filtered_df)

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
8    dog  7.0       2       no
9    dog  3.0       1       no

## TITANIC